src/test/resources/getEmployeeByName.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://www.jpworks.com/employee">
    <soapenv:Header/>
    <soapenv:Body>
        <emp:EmployeeByNameRequest firstname="John" lastname="Miller"/>
    </soapenv:Body>
</soapenv:Envelope>